---
type: BasePoint
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# BasePoint

`Autodesk.Revit.DB.BasePoint` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetProjectBasePoint | 2020.2 | `public static BasePoint GetProjectBasePoint ( Document cda )` |
| Method | GetSurveyPoint | 2020.2 | `public static BasePoint GetSurveyPoint ( Document cda )` |
| Property | Clipped | 2021.1 | `public bool Clipped { get ; set ; }` |
| Property | IsShared | — | `public bool IsShared { get ; }` |
| Property | Parameter | — | `` |
| Property | Position | 2019.2 | `public XYZ Position { get ; }` |
| Property | SharedPosition | 2019.2 | `public XYZ SharedPosition { get ; internal set ; }` |